{
  "linkedin": {
    "email": "your-email@example.com",
    "password": "your-password"
  },
  "limits": {
    "maxProfileViewsPerDay": 80,
    "minDelaySeconds": 3,
    "maxDelaySeconds": 10,
    "delayStdDev": 1.5
  },
"qualification": {
    "criteria": [
      "Connectors: Fractional executives (COO, CFO, CTO), business operations consultants, digital transformation consultants, agency owners",
      "Mid-market decision makers: Directors/VPs of Operations, CTOs, COOs at 100-500 employee companies",
      "Active on LinkedIn: Posts regularly, engages with content, has 500+ connections",
      "Located in Colorado/Mountain West region or works remotely with mid-market companies",
      "Works with or at companies facing operational scaling challenges"
    ],
    "idealProfile": "I'm looking for two types of people: (1) Connectors who work with multiple mid-market companies and could refer implementation work - fractional executives, operations consultants, agency owners who need technical partners; (2) Operations leaders at mid-market companies (100-500 employees) who are exploring AI/automation and need someone who can actually build and deploy systems. Ideal connectors have 'fractional,' 'consultant,' or 'advisor' in their title and work across multiple clients. Ideal direct prospects post about operational challenges, scaling issues, or efficiency improvements.",
    "disqualifiers": [
      "Works at enterprise companies (1000+ employees) - too big, different buying process",
      "Works at startups under 50 employees - typically can't afford implementation work",
      "Pure strategy consultants from Big 4 (Deloitte, McKinsey, etc.) - unlikely to refer technical work",
      "Solopreneurs/coaches without business operations experience",
      "Works in industries with very low AI adoption: agriculture, hospitality, non-profit (unless tech-forward)",
      "Junior individual contributors without influence on tool/vendor decisions"
    ],
    "minScore": 70
  },
  "browser": {
    "userDataDir": "./chrome-profile",
    "headless": false,
    "viewport": {
      "width": 1280,
      "height": 800
    }
  }
}
